app/controllers/blog_controller.rb

SELECT "blogs".* FROM "blogs"
SELECT COUNT(*) AS count_all, "replies"."blog_id" AS replies_blog_id FROM "replies" GROUP BY "replies"."blog_id"
---
	def index
		@blogs = Blog.all
		@new_blog = Blog.new
		@reply = Reply.group(:blog_id).count

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."blog_id" = ?  [["blog_id", 3]]
---
	def show
		@blog = Blog.find(params[:id])
		@new_reply = Reply.new
		@comments = Reply.where(blog_id: params[:id])

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "blogs" SET "like" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["like", 8], ["updated_at", "2017-08-15 03:51:01.563197"], ["id", 14]]
---
	def like
		Blog.transaction do
		  Blog.where(id: params[:id]).update_all('like++')

INSERT INTO "blogs" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "test"], ["created_at", "2017-08-10 21:04:46.293316"], ["updated_at", "2017-08-10 21:04:46.293316"]]
---
	def create_blog
		Blog.transaction do
			Blog.create(body: params[:blog][:body], like: 0)

INSERT INTO "replies" ("blog_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["blog_id", 12], ["comment", "こめんと"], ["created_at", "2017-08-10 21:29:12.192475"], ["updated_at", "2017-08-10 21:29:12.192475"]]
---
	def create_reply
		Reply.transaction do
			Reply.create(comment: params[:reply][:comment], blog_id: params[:id])